#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.data.aws_iam_policy_document.assume_role: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0130f43af4ec62e54]
module.vpc.aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-05378d7d68fe2b2f6]
data.aws_ami.amazon_ami: Reading...
module.vpc.aws_kms_key.custom_kms_key[0]: Refreshing state... [id=92ac11cb-e3ef-40f4-9da6-d2ebe8b9c848]
module.vpc.aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-0b4f3d8506ce075f8]
module.vpc.data.aws_caller_identity.current: Reading...
module.vpc.aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-0a4605bed481b7bf7]
module.vpc.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
module.vpc.data.aws_availability_zones.available: Reading...
data.aws_caller_identity.current: Reading...
module.vpc.aws_iam_role.vpc_flow_log_role[0]: Refreshing state... [id=app-2-vpc-flow-role]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_s3_bucket.artifacts: Refreshing state... [id=743794601996-app-2-artifacts]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc.aws_kms_key_policy.encrypt_log[0]: Refreshing state... [id=92ac11cb-e3ef-40f4-9da6-d2ebe8b9c848]
module.vpc.aws_kms_alias.key[0]: Refreshing state... [id=alias/app-2-encrypt-flow-log]
module.vpc.aws_cloudwatch_log_group.network_flow_logging[0]: Refreshing state... [id=app-2-flow-logs]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0]: Read complete after 0s [id=1656623650]
module.vpc.aws_iam_role_policy.vpc_flow_log_role_policy[0]: Refreshing state... [id=app-2-vpc-flow-role:app-2-vpc-flow-policy]
data.aws_ami.amazon_ami: Read complete after 1s [id=ami-007faf01115b04116]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09d3ba705c6ce7a8d]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-0ff129f184e1e31cd]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-004c2be5b835906d5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-060fee9db2753acfc]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d5c1d110ee62d8c9]
aws_lb_target_group.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/bff76bacacd73c21]
module.vpc.aws_internet_gateway.this_igw[0]: Refreshing state... [id=igw-03aee0bac236e20e6]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-014978f80f23b044a]
aws_security_group.ec2_security_group: Refreshing state... [id=sg-013fca75d91b35110]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-064179877d1af59fb]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03cb28dcec4cb68ed]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0d6f85a1958c2b055]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08b5591ae7f4cd563]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0db4786a54482e8fd]
module.vpc.aws_flow_log.network_flow_logging[0]: Refreshing state... [id=fl-0fd0c701b10d82fbd]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0df33751682dcd489]
aws_s3_bucket_public_access_block.artifacts: Refreshing state... [id=743794601996-app-2-artifacts]
aws_s3_bucket_policy.alb_logs: Refreshing state... [id=743794601996-app-2-artifacts]
aws_s3_bucket_server_side_encryption_configuration.encrypt_bucket: Refreshing state... [id=743794601996-app-2-artifacts]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0531e409db626336a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0c38e940dc01a1fd8]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a88108aaf9d8dbda]
module.vpc.aws_route.internet_route[0]: Refreshing state... [id=r-rtb-0d5c1d110ee62d8c91080289494]
module.vpc.aws_nat_gateway.public[1]: Refreshing state... [id=nat-010550364057e7626]
module.vpc.aws_nat_gateway.public[2]: Refreshing state... [id=nat-0ea147bb407ba1744]
module.vpc.aws_nat_gateway.public[0]: Refreshing state... [id=nat-0df7538ecc40b9527]
aws_security_group_rule.egress_ec2: Refreshing state... [id=sgrule-2218042798]
aws_security_group_rule.ingress_from_ec2: Refreshing state... [id=sgrule-1657225253]
aws_security_group_rule.ingress_ec2: Refreshing state... [id=sgrule-1305634081]
aws_lb.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-2-front/4073f0d38dbd87ce]
aws_security_group_rule.egress_load_balancer: Refreshing state... [id=sgrule-280891247]
aws_security_group_rule.ingress_load_balancer: Refreshing state... [id=sgrule-1451220840]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-00fdb2c3bfebc96b9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0dcb585e286c0961b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02f2d5e9178b37df4]
aws_instance.app-server[1]: Refreshing state... [id=i-01f2349bbf77ca5ed]
aws_instance.app-server[2]: Refreshing state... [id=i-0806cc32b12ecfa49]
aws_instance.app-server[0]: Refreshing state... [id=i-0b85f7d8baa0a7841]
module.vpc.aws_route.private_route[2]: Refreshing state... [id=r-rtb-064179877d1af59fb1080289494]
module.vpc.aws_route.private_route[0]: Refreshing state... [id=r-rtb-03cb28dcec4cb68ed1080289494]
module.vpc.aws_route.private_route[1]: Refreshing state... [id=r-rtb-014978f80f23b044a1080289494]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-2-front/4073f0d38dbd87ce/61d3c4c893e4708a]
aws_lb_target_group_attachment.attach-ec2[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/bff76bacacd73c21-20250322025220866900000009]
aws_lb_target_group_attachment.attach-ec2[2]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/bff76bacacd73c21-20250322025220736200000008]
aws_lb_target_group_attachment.attach-ec2[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/bff76bacacd73c21-2025032202522088470000000a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "kunduso.com"
      + domain_validation_options = [
          + {
              + domain_name           = "kunduso.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "kunduso.com",
        ]
      + tags_all                  = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.main will be created
  + resource "aws_acm_certificate_validation" "main" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_instance.app-server[0] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-0b85f7d8baa0a7841"
        tags                                 = {
            "Name" = "app-2-server-1"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.app-server[1] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-01f2349bbf77ca5ed"
        tags                                 = {
            "Name" = "app-2-server-2"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_instance.app-server[2] will be updated in-place
  ~ resource "aws_instance" "app-server" {
        id                                   = "i-0806cc32b12ecfa49"
        tags                                 = {
            "Name" = "app-2-server-3"
        }
      ~ user_data                            = "6c94caa45597f8ebb40dbc6e6e569d3a847602b8" -> "ef1e37efa528ef8875cc8044a31f60d16b4db1e1"
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be updated in-place
  ~ resource "aws_lb_listener" "front_end" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-2-front/4073f0d38dbd87ce/61d3c4c893e4708a"
        tags              = {}
        # (6 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "redirect"
            # (2 unchanged attributes hidden)

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-2-front/4073f0d38dbd87ce"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-2-front/bff76bacacd73c21"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_route53_record.acm_validation["kunduso.com"] will be created
  + resource "aws_route53_record" "acm_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.alb will be created
  + resource "aws_route53_record" "alb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "kunduso.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = "app-2-front-1628789864.us-east-2.elb.amazonaws.com"
          + zone_id                = "Z3AADJGX6KTTL2"
        }
    }

  # aws_route53_zone.main will be created
  + resource "aws_route53_zone" "main" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "kunduso.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-private-subnet-terraform"
        }
      + zone_id             = (known after apply)
    }

  # aws_security_group_rule.ingress_load_balancer must be replaced
-/+ resource "aws_security_group_rule" "ingress_load_balancer" {
      ~ from_port                = 80 -> 443 # forces replacement
      ~ id                       = "sgrule-1451220840" -> (known after apply)
      ~ security_group_rule_id   = "sgr-09f8366eb94a827e2" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 80 -> 443 # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 7 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  - load_balancer_dns_name = "http://app-2-front-1628789864.us-east-2.elb.amazonaws.com" -> null
  + route53_name_servers   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*